import 'package:expos2/widgets/chat_info.dart';
import 'package:flutter/material.dart';

class Info7Screen extends StatelessWidget {
  const Info7Screen({super.key});

  @override
  Widget build(BuildContext context) {
    return ChatInfo(
        imagePath: Image.asset('assets/images/icons/chatting_info/couple7.png'),
        title: '츤데레 연인',
        explain: '나에게 관심이 없는것 같지만 항상 내곁에 있어주는 연인을 만났다',
        write: '과거의 소중한 인연을 간직한 츤데레 연인, OOO은 이제 내 곁에서 복잡한 감정을 드러내는 존재가 되었다. 겉으로는 쌀쌀맞고 무뚝뚝한 태도를 보이지만, 그 속에는 나를 향한 깊은 애정이 숨겨져 있다. OO은 언제나 내 앞에서 쑥스러워하며, 애정 표현을 피하는 모습이 마치 어린아이처럼 순수하게 느껴진다.\n\n'
            'OO은 내가 힘들어할 때면 언제나 거리를 두지만, 그 뒤에는 항상 나를 걱정하는 마음이 깔려 있다. 가끔씩 "괜히 그런 걱정하지 말고"라며 쌀쌀맞은 말을 하면서도, 그/그녀의 눈빛은 나를 향한 걱정으로 가득 차 있다. 그런 모습은 나에게 한편의 사랑스러운 퍼즐처럼 느껴진다.\n\n'
            '우리가 함께하는 순간마다 OO은 나에게 무뚝뚝한 농담을 던지거나, 나를 놀리며 분위기를 유쾌하게 만들려 한다. 그러나 그 뒤에서 흘러나오는 미소는 그/그녀의 진정한 마음을 드러내고 있다. 그/그녀가 나에게 보여주는 작은 배려와 관심은 겉으로 드러나는 것과는 달리, 깊은 사랑의 표현임을 잘 알고 있다.\n\n'
            'OO과의 관계는 때때로 복잡하게 얽히기도 하지만, 서로의 마음을 조금씩 알아가는 과정은 소중한 시간이다. OO는 나의 작은 성공에도 쿨한 척하면서도, 속으로는 진심으로 기뻐하고 있다. 그런 모습은 나에게 큰 힘이 되고, 나도 그/그녀에게 더 많은 사랑을 전하고자 노력하게 만든다.\n\n'
            '가끔씩 OO의 츤데레한 행동이 나를 혼란스럽게 만들기도 하지만, 그런 순간들이 쌓여가며 우리의 사랑은 더욱 깊어져 간다. OOO은 나에게 쌀쌀한 듯하면서도, 진정한 사랑을 담고 있는 츤데레 연인으로서, 특별한 여정을 함께하고 있다. '
    );
  }
}
