import 'package:expos2/widgets/chat_info.dart';
import 'package:flutter/material.dart';

class Info4Screen extends StatelessWidget {
  const Info4Screen({super.key});

  @override
  Widget build(BuildContext context) {
    return ChatInfo(
        imagePath: Image.asset('assets/images/icons/chatting_info/couple4.png'),
        title: '활발한 연인',
        explain: '화이팅과 힘이 넘치는 매일 활발한 연인을 만났다',
        write: '어릴 적부터 언제나 주변을 환하게 밝히던 정하린은 이제 활발하고 에너지가 넘치는 연인으로 성장했다. OOO는 항상 새로운 경험을 찾아 나서고, 친구들과의 모임에서는 주인공처럼 모든 이들의 시선을 사로잡았다. 그 누구보다도 긍정적이고 생기 넘치는 모습은 사람들에게 큰 힘이 되었다.\n\n'
            'OO은 연인과의 관계에서도 그 활발한 성격을 그대로 드러낸다. 주말마다 함께 하이킹을 가거나, 새로운 카페를 탐방하는 것이 그녀의 일상이다. OO는 언제나 연인에게 새로운 모험을 제안하며, 함께하는 매 순간을 특별하게 만드는 데 큰 열정을 쏟는다. 그들의 데이트는 늘 다채롭고, 예측할 수 없는 사건들로 가득하다.\n\n'
            'OO은 연인의 기분을 살피고, 그/그녀가 힘들어할 때마다 자신의 에너지를 나누어주려 한다. 그/그녀의 긍정적인 마인드는 연인에게도 큰 위로가 되며, 두 사람은 함께하는 시간 속에서 더욱 깊은 유대감을 키워나간다. 가끔씩 OO의 지나치게 활발한 모습에 연인이 놀라기도 하지만, 그런 모습이 오히려 그/그녀의 마음에 따뜻함을 더해준다.\n\n'
            '그/그녀의 마음속에는 언제나 새로운 도전과 즐거움이 자리 잡고 있다. OO은 연인과의 관계에서도 서로의 꿈을 응원하고, 함께 성장해 나가는 것에 큰 가치를 두고 있다. 두 사람은 서로의 에너지를 주고받으며, 함께하는 모든 순간을 소중히 여기고 있다.\n\n'
            '가끔씩 OO의 무모한 도전이 두 사람을 위기 상황으로 몰아넣기도 하지만, 그 속에서 발견한 웃음과 감동은 그들의 관계를 더욱 단단하게 만들어준다. OOO은 활발한 연인으로서, 사랑과 모험을 함께 나누며 행복한 여정을 이어가고 있다. '
    );
  }
}
