import 'package:expos2/widgets/chat_info.dart';
import 'package:flutter/material.dart';

class Info6Screen extends StatelessWidget {
  const Info6Screen({super.key});

  @override
  Widget build(BuildContext context) {
    return ChatInfo(
        imagePath: Image.asset('assets/images/icons/chatting_info/couple6.png'),
        title: '사극체 연인',
        explain: '잠에서 일어나니 조선시대로 와있었다 그런데..  여기서 현연인을 만났다',
        write: '잠에서 일어나니 조선시대의 한 골목에 서 있었다. 그곳에서 만난 연인, 이수빈은 차분한 목소리로 나를 맞아주었다. 고운 한복을 입고, 단아한 미소를 지닌 OOO는 마치 과거의 상상 속 인물처럼 느껴졌다. OOO는 세련된 말투와 함께 고전적인 예의를 갖추며 나를 대했다.\n\n'
            'OO은 언제나 나의 곁에서 나를 지켜주고, 나의 소소한 걱정까지도 귀담아들었다. OO의 따뜻한 눈빛은 조선시대의 찬란한 햇살처럼 나를 감싸주었다. 우리는 함께 전통 시장을 돌아다니며, 수많은 사람들과 소통하고, 그 속에서 소중한 순간들을 나누었다. OO의 활기찬 성격은 언제나 나를 웃게 만들었고, 그런 모습은 마치 동화 속의 주인공을 보는 듯했다.\n\n'
            '때때로 OO은 나에게 조선의 역사나 문화에 대해 이야기해주며, 나를 이 시대에 더 잘 적응하도록 도와주었다. OO의 지혜와 배려는 나에게 큰 힘이 되었고, 서로의 마음을 나누는 과정에서 우리는 더욱 가까워졌다. OO은 나의 고민을 진심으로 이해하고, 나에게 소중한 조언을 아끼지 않았다.\n\n'
            '그러나 이 시대의 규범과 제약 속에서 우리의 사랑은 때때로 시험에 들기도 했다. 서로를 바라보는 애틋한 눈빛 속에는, 이 사랑이 과연 어떤 결말을 맞이할지에 대한 불안감이 스쳤다. 그럼에도 불구하고, OO은 언제나 나에게 힘을 주며, 우리의 사랑이 이 시대의 경계를 넘을 수 있음을 믿게 했다.\n\n'
            '이처럼 OOO은 조선시대의 연인으로서, 나에게 사랑과 위로를 주는 존재가 되었다. OO와의 시간은 언제나 특별했고, 우리는 함께 이 시대의 아름다움을 느끼며, 소중한 기억을 쌓아가고 있다. '
    );
  }
}
