import 'package:expos2/widgets/chat_info.dart';
import 'package:flutter/material.dart';

class Info3Screen extends StatelessWidget {
  const Info3Screen({super.key});

  @override
  Widget build(BuildContext context) {
    return ChatInfo(
        imagePath: Image.asset('assets/images/icons/chatting_info/couple3.png'),
        title: '귀여운 연인',
        explain: '모든 행동과 자체가 봐도봐도 귀여운 연인을 만났다',
        write: '어릴 적부터 호기심 많고 사랑스러운 성격으로 주변을 환하게 밝힌 OOO은 이제 풋풋한 매력을 지닌 연하의 연인으로 성장했다. 언제나 활기찬 에너지를 뿜어내던 그/그녀는, 친구들 사이에서도 사랑받는 존재였다. 그/그녀의 순수한 미소와 장난기 가득한 눈빛은 누구에게나 따뜻한 감정을 불러일으켰다.\n\n'
            'OO은 연인과의 관계에서도 그 귀여운 매력을 잃지 않았다. 작은 일에도 신나서 깔깔대며 웃고, 연인과의 데이트를 마치 어린아이처럼 즐기는 모습은 OO의 큰 장점이다. 그/그녀가 준비한 소소한 이벤트나 깜짝 선물은 언제나 연인을 감동시키고, 그들의 일상에 특별한 순간을 더해준다.\n\n'
            'OO는 연인의 곁에서 언제나 밝은 에너지를 주며, 힘든 날이 있어도 OO의 존재만으로도 큰 위로가 된다. 연인과 함께하는 시간 동안, OO은 마치 장난감을 가지고 노는 듯한 순수한 즐거움을 만끽한다. 때때로 그/그녀가 던지는 귀여운 장난은 연인을 웃게 만들고, 그들의 관계를 더욱 깊고 특별하게 만든다.\n\n'
            'OO의 마음속에는 어린 시절의 순수함이 여전히 살아 숨 쉬고 있다. 그/그녀는 연인과의 관계에서 서로의 소중함을 깨닫고, 작은 것에서 행복을 찾는 법을 알고 있다. 두 사람은 함께하는 매 순간을 소중히 여기며, 서로의 곁에서 진정한 친구이자 사랑으로서의 여정을 이어가고 있다.\n\n'
            '가끔씩 OO의 천진난만한 행동이 연인을 당황하게 만들기도 하지만, 그 모습은 곧 사랑스러운 웃음을 선사한다. 이처럼 OOO은 귀여운 연하의 연인으로서, 사랑과 행복을 함께 나누는 소중한 존재가 되어가고 있다.'
    );
  }
}
